--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/sarahglenn/Documents/UNC/Summer 2024/460/Output/project.log
  log type:  text
 opened on:  17 Jun 2024, 20:08:10

. use "/Users/sarahglenn/Documents/UNC/Summer 2024/460/Original Data/project.dta"

. 
. * Deepali Paasha, Sarah Glenn, Suhailah Boukarfi, Prerna Dash
. 
. * Cleaning Data
. 
. * drop N/A and missing values
. drop if incwage > 999997
(1,126,731 observations deleted)

. 
. * drop missing values
. drop if sex > 2
(0 observations deleted)

. 
. * drop missing values
. drop if marst > 6
(0 observations deleted)

. 
. * drop missing/unknown values
. drop if educ < 1 
(88,539 observations deleted)

. drop if educ > 11
(0 observations deleted)

. 
. * drop unknown values
. drop if metro < 1
(803,154 observations deleted)

. 
. * drop missing values
. drop if age > 140
(0 observations deleted)

. 
. * drop missing values
. drop if empstat < 1
(0 observations deleted)

. drop if empstat > 3
(0 observations deleted)

. 
. * generate indicator metro variable: not metro area = 0, metro area = 1
. gen metroInd = 0 if metro == 1
(4,025,185 missing values generated)

. replace metroInd = 1 if metro >= 2
(4,025,185 real changes made)

. 
. * generate indicator variable: male = 0, female = 1
. gen female = 1 if (sex == 2)
(2,226,361 missing values generated)

. replace female = 0 if (sex == 1)
(2,226,361 real changes made)

. 
. * generate indicator variable: not black = 0, black = 1
. gen black = (race == 2)

. 
. * generate indicator variable: married, spouse present = 1, not = 0
. gen marstInd = 1 if marst == 1
(2,331,916 missing values generated)

. replace marstInd = 0 if marst > 1
(2,331,916 real changes made)

. 
. * generate post variable for difference in differences analysis
. gen post = (year == 2022)

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        year |  4,594,507    2020.531    1.499677       2019       2022
      sample |  4,594,507    202054.1    149.9677     201901     202201
      serial |  4,594,507      714263    427394.4          1    1505108
    cbserial |  4,594,507    2.02e+12    1.50e+09   2.02e+12   2.02e+12
        hhwt |  4,594,507    97.36223    83.19337          1       3118
-------------+---------------------------------------------------------
     cluster |  4,594,507    2.02e+12    1.50e+09   2.02e+12   2.02e+12
       metro |  4,594,507    3.018473    1.017115          1          4
      strata |  4,594,507      484527    873628.8      10004    8100351
          gq |  4,594,507    1.151413     .614717          1          5
      pernum |  4,594,507    1.711154    1.030566          1         20
-------------+---------------------------------------------------------
       perwt |  4,594,507     100.736    87.48429          1       3118
         sex |  4,594,507     1.51543    .4997619          1          2
         age |  4,594,507    49.18655    19.62439         16         97
       marst |  4,594,507    3.126183    2.244182          1          6
        race |  4,594,507    2.150744    2.260307          1          9
-------------+---------------------------------------------------------
       raced |  4,594,507    218.1084    232.1151        100        990
        educ |  4,594,507    7.591011      2.3009          1         11
       educd |  4,594,507    78.22523    23.05429         11        116
     empstat |  4,594,507     1.81859    .9708375          1          3
    empstatd |  4,594,507     18.2278    9.679263         10         30
-------------+---------------------------------------------------------
     occ2010 |  4,594,507    5622.471    3471.449         10       9920
         ind |  4,594,507    4711.806    3619.985          0       9920
    uhrswork |  4,594,507    24.06894    21.07081          0         99
     incwage |  4,594,507    35849.25    65232.32          0     791000
    metroInd |  4,594,507    .8760864     .329483          0          1
-------------+---------------------------------------------------------
      female |  4,594,507    .5154298    .4997619          0          1
       black |  4,594,507    .0947858    .2929189          0          1
    marstInd |  4,594,507    .4924557    .4999431          0          1
        post |  4,594,507     .510381    .4998923          0          1

. 
. *  Basic regression
. reg incwage i.female##i.post

      Source |       SS           df       MS      Number of obs   = 4,594,507
-------------+----------------------------------   F(3, 4594503)   =  30292.96
       Model |  3.7921e+14         3  1.2640e+14   Prob > F        =    0.0000
    Residual |  1.9172e+16 4,594,503  4.1727e+09   R-squared       =    0.0194
-------------+----------------------------------   Adj R-squared   =    0.0194
       Total |  1.9551e+16 4,594,506  4.2553e+09   Root MSE        =     64597

------------------------------------------------------------------------------
     incwage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    1.female |  -17719.86   86.17994  -205.61   0.000    -17888.77   -17550.95
      1.post |   3451.656   86.60464    39.86   0.000     3281.914    3621.398
             |
 female#post |
        1 1  |  -303.1106   120.6288    -2.51   0.012    -539.5388    -66.6823
             |
       _cons |   43300.63   61.88973   699.64   0.000     43179.32    43421.93
------------------------------------------------------------------------------

. outreg2 using projecttable.xls, replace
projecttable.xls
dir : seeout

. 
. * Multivariate regressions
. reg incwage i.female##i.post uhrswork black metroInd i.educ age marstInd

      Source |       SS           df       MS      Number of obs   = 4,594,507
-------------+----------------------------------   F(17, 4594489)  >  99999.00
       Model |  6.5986e+15        17  3.8815e+14   Prob > F        =    0.0000
    Residual |  1.2952e+16 4,594,489  2.8191e+09   R-squared       =    0.3375
-------------+----------------------------------   Adj R-squared   =    0.3375
       Total |  1.9551e+16 4,594,506  4.2553e+09   Root MSE        =     53095

--------------------------------------------------------------------------------------
             incwage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
            1.female |  -8621.968   71.40001  -120.76   0.000    -8761.909   -8482.026
              1.post |   4452.384   71.21263    62.52   0.000      4312.81    4591.958
                     |
         female#post |
                1 1  |  -1584.261   99.15533   -15.98   0.000    -1778.602    -1389.92
                     |
            uhrswork |   1464.231   1.334449  1097.26   0.000     1461.616    1466.847
               black |  -3535.671   85.66493   -41.27   0.000    -3703.572   -3367.771
            metroInd |   7975.181   76.00873   104.92   0.000     7826.206    8124.155
                     |
                educ |
grade 5, 6, 7, or 8  |   812.5881   415.5996     1.96   0.051     -1.97235    1627.149
            grade 9  |   5981.637   432.0061    13.85   0.000     5134.921    6828.354
           grade 10  |    9435.44   410.4902    22.99   0.000     8630.893    10239.99
           grade 11  |   8499.958   403.9884    21.04   0.000     7708.155    9291.761
           grade 12  |    2632.75   377.7521     6.97   0.000     1892.369    3373.131
  1 year of college  |   5114.032   381.4809    13.41   0.000     4366.343    5861.721
 2 years of college  |   6666.039   385.5426    17.29   0.000      5910.39    7421.689
 4 years of college  |   23790.02   379.6382    62.66   0.000     23045.94    24534.09
5+ years of college  |   43827.22   381.7487   114.81   0.000        43079    44575.43
                     |
                 age |   172.8827   1.444384   119.69   0.000     170.0517    175.7136
            marstInd |   9607.225   53.40401   179.90   0.000     9502.555    9711.895
               _cons |  -30285.52    396.417   -76.40   0.000    -31062.48   -29508.55
--------------------------------------------------------------------------------------

. outreg2 using projecttable.xls, append dec(3)
projecttable.xls
dir : seeout

. 
. save "/Users/sarahglenn/Documents/UNC/Summer 2024/460/Cleaned Data/project-cleaned.dta", replace
file /Users/sarahglenn/Documents/UNC/Summer 2024/460/Cleaned Data/project-cleaned.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/sarahglenn/Documents/UNC/Summer 2024/460/Output/project.log
  log type:  text
 closed on:  17 Jun 2024, 20:08:31
--------------------------------------------------------------------------------------------------
